using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Ex37
{
    /*
     * Создайте новый публичный класс Bird в том же файле и том же namespace, что и класс Program. 
     * Объявите в классе Bird четыре переменные: name, age, breed, continent. 
     * Переменная continent должна являться публичным перечислением, содержащим все существующие на текущий момент континенты.
     * Перечисление должно быть объявлено в том же файле и том же namespace, что и класс Program.
     * Тип и модификатор доступа остальных переменных определите самостоятельно. 
     * Переопределите метод ToString() для класса Bird так, чтобы он выводил информацию об экземпляре класса в следующем формате: 
     * "Привет!!! Я птичка и меня зовут ХХХ!!! Мне ХХХ лет и я отношусь к породе: ХХХ, которая водится на континенте: ХХХ!".
     * ХХХ - значения соответствующих переменных класса Bird. 
     * Внутри метода Main() создайте 2 экземпляра класса Bird используя статическую инициализацию и выведите в консоль информацию 
     * по созданным экземплярам, каждый экземпляр с новой строки.
     */

    public class Program
    {
        public static void Main(string[] args)
        {
            /* Добавьте свой код ниже */
        }
    }
    /* Добавьте свой код ниже */
}
